// Управление двигателем постоянного тока, приводом каретки рейсмуса.

#include "Driver_TA6586.h"

Driver::Driver(PinName pinDriverFw, PinName pinDriverRw) {
    pinFw = pinDriverFw;
    pinRw = pinDriverRw;

    // Настроим порты
    pinMode(pinFw, GPIO_Mode_Out_PP);
    pinMode(pinRw, GPIO_Mode_Out_PP);
    
    stop();      // Отключим питание двигателя
}

//==============================================================================
// Включение двигателя на движение вперед
//------------------------------------------------------------------------------
void Driver::forward(void) {
    pinWrite(pinFw, HIGH);
    pinWrite(pinRw, LOW);
    state = DrvState::Forward;
}

//==============================================================================
// Включение двигателя на движение назад
//------------------------------------------------------------------------------
void Driver::reward(void) {
    pinWrite(pinFw,LOW);
    pinWrite(pinRw, HIGH);
    state = DrvState::Reward;
}

//==============================================================================
// Выключение двигателя (снятие питания)
//------------------------------------------------------------------------------
void Driver::stop(void){
   pinWrite(pinFw, LOW);  
   pinWrite(pinRw, LOW);  
   state = DrvState::Stopped;
}

//==============================================================================
// Торможение двигателя и затем - отключение
//------------------------------------------------------------------------------
void Driver::braking(void){
    pinWrite(pinFw, HIGH);
    pinWrite(pinRw, HIGH);
    state = DrvState::Braking;
    delay(BRAKING_DELAY);
    stop();
}

//==============================================================================
// Вернуть текущий статус двигателя
//------------------------------------------------------------------------------
DrvState Driver::getState(void) {
    return state;
}
